"10003" = "A minor internal error has occurred. We would appreciate a report sent to <support@barebones.com>, with a description of what you were doing at the time ";
"10112" = "Insufficient memory to complete this operation";
"10113" = "Permission denied";
"10150" = "Network is down";
"10151" = "Network is unreachable";
"10152" = "Network dropped connection on reset";
"10153" = "Software caused connection abort";
"10154" = "Connection reset by peer";
"10157" = "Socket is not (or no longer) connected";
"10160" = "Connection timed out";
"10161" = "Connection refused by remote host";
"10164" = "Host is down";
"10165" = "No route to host";
"10307" = "Host name lookup failed (no data returned). The server name may have been entered incorrectly, or a name server is temporarily unreachable";
"11101" = "Internal array error";
"12001" = "The search string couldn’t be used to search a multibyte text buffer";
"12002" = "A multi-byte non-Roman search string can’t be used to search a single-byte text buffer";
"12003" = "The replacement string couldn’t be computed, because the previous Grep search did not succeed";
"12501" = "An error occurred while reading this Zip archive";
"12502" = "This file looks enough like a Zip archive to fool BBEdit, but isn't one; or it may be a Zip archive, but damaged";
"12503" = "An internal error occurred while reading the Zip archive data";
"12504" = "This Zip archive's data may be damaged";
"13100" = "An untitled window needed for this operation has been closed";
"13109" = "The line height resulting from this font choice would exceed the display height of the text view";
"13110"	= "Exporting this document to text will overwrite a non-text document. Please don’t do that. Just… don’t.";
"13200" = "This operation is not permitted on the current selection";
"13202" = "Soft wrapping cannot be enabled when there is a rectangular selection";
"13203" = "Cannot access multiple selection ranges in a soft-wrapped text view";
"13216" = "This document instance cannot exist in multiple windows simultaneously.";
"13219" = "This item can’t be used, because it is not a regular file";
"13252" = "A “Save As” panel is already open for this document in another window";
"13301" = "The front window isn’t in a scripting language BBEdit currently recognizes";
"13302" = "This command isn’t supported for Shell scripts";
"13303" = "This command isn’t supported for Python scripts";
"13304" = "This file doesn’t appear to contain a valid ‘shebang’ line";
"13305" = "The unix tool referenced in the ‘shebang’ line cannot be found";
"13306" = "The interpreter or shell to run this script cannot be found";
"13307" = "The file you picked doesn’t appear to be a Unix Script file";
"13308" = "The front window doesn’t appear to contain a Unix Script";
"13309" = "The script being run is neither a Unix executable nor a text file";
"13310" = "The script being run does not begin with a #! (shebang), or it contains a byte-order mark (BOM).\n\nUnix scripts and filters should be saved using the “Unicode (UTF-8)” encoding.\n\n";
"13400" = "The file encoding specified in a “read as” parameter was invalid or unknown to the system";
"13401" = "This file was not saved, because it contained characters that could not be represented in the specified encoding";
"13402" = "A requested operation could not be completed, because the window is in use by a sheet";
"13407" = "A script file referred to by this clipping was not, in fact, an executable AppleScript";
"13501" = "Couldn’t spawn sub-process. Exec failed.";
"13502" = "Couldn’t spawn sub-process. Too many arguments.";
"13705" = "This Text Factory cannot be run, because one or more operations have not been configured";
"20000" = "The shell worksheet could not determine the current working directory";
"20001" = "BBEdit cannot perform an authenticated save or open because the current version of the command line tool could not be installed";
"20002" = "BBEdit cannot perform an authenticated save because the command line tool could not be found";
"20003" = "The authenticated read for this file failed";
"20004" = "The authenticated save for this file failed";
"20009" = "The named grep pattern could not be found.";
"20010" = "This Text Factory document is malformed and cannot be read";
"20011" = "This Text Factory refers to a configured web site that does not exist";
"20016" = "This unix filter must be have a valid shebang line or be executable.";
"20017" = "This Text Factory does not specify which files or folders to process";
"20018" = "This input will give your Worksheet heartburn";
"20019" = "This file doesn’t appear to be under Perforce control";
"20020" = "BBEdit cannot communicate with the Perforce server";
"20022" = "BBEdit cannot save this binary property list; it is malformed";
"20023" = "BBEdit cannot read this file group document; the format is too old.";
"20024" = "BBEdit cannot read this file group document; it is damaged or malformed.";
"20025" = "BBEdit cannot read this file group document; it is damaged or malformed.";
"20026" = "BBEdit cannot read this file group document; it is damaged or malformed.";
"20027" = "BBEdit cannot read this file group document; it is damaged or malformed.";
"20028" = "BBEdit cannot read this file group document; it is damaged or malformed.";
"20029" = "BBEdit cannot read this file group document; it is damaged or malformed.";
"20030" = "BBEdit cannot read this file group document; some required data is missing.";
"20031" = "BBEdit cannot read this file group document; the format is too old.";
"20032" = "BBEdit cannot read this project document; it was created by a newer version of BBEdit.";
"22100" = "kErrGetHostNameFailed";
"22101" = "kErrHostWithoutDomain";
"22102" = "kErrSetLinger";
"22103" = "kErrSetTypeOfService";
"22104" = "kErrSetOutOfBandInline";
"22105" = "kErrHostUnknown";
"22106" = "kErrNewStreamSocket";
"22107" = "kErrDupSocket";
"22108" = "kErrFdopenR";
"22109" = "kErrFdopenW";
"22110" = "kErrGetSockName";
"22111" = "kErrBindDataSocket";
"22112" = "kErrListenDataSocket";
"22113" = "kErrPassiveModeFailed";
"22114" = "kErrServerSentBogusPortNumber";
"22115" = "kErrConnectDataSocket";
"22116" = "kErrAcceptDataSocket";
"22117" = "kErrSetStartPoint";
"22118" = "kErrConnectMiscErr";
"22119" = "kErrConnectRetryableErr";
"22120" = "The remote server refused the connection. This may indicate a configuration problem with the server";
"22121" = "kErrBadTransferType";
"22122" = "kErrInvalidDirParam";
"22123" = "kErrMallocFailed";
"22124" = "The server refused to process the 'PWD' command. This may indicate a problem with the server";
"22125" = "The server refused to process the 'CWD' command. This may indicate a problem with the server";
"22126" = "The server refused to process the 'RMD' command. This may indicate a problem with the server";
"22127" = "kErrBadLineList";
"22128" = "kErrUnimplementedOption";
"22129" = "kErrUnimplementedFunction";
"22130" = "The server refused to process the 'LIST' command. This may indicate a problem with the server";
"22131" = "The server refused to process the 'RETR' command. This may indicate a problem with the server";
"22132" = "The server refused to process the 'STOR' command. This may indicate a problem with the server";
"22133" = "kErrWriteFailed";
"22134" = "kErrReadFailed";
"22135" = "kErrSocketWriteFailed";
"22136" = "kErrSocketReadFailed";
"22137" = "kErrOpenFailed";
"22138" = "kErrBadMagic";
"22139" = "kErrBadParameter";
"22140" = "kErrMKDFailed";
"22141" = "kErrCannotGoToPrevDir";
"22142" = "The server refused to process the 'SITE CHMOD' command";
"22143" = "kErrUmaskFailed";
"22144" = "The server refused to process the 'DELE' command";
"22145" = "The server refused to process the 'SIZE' command";
"22146" = "The server refused to process the 'MDTM' command";
"22147" = "kErrTYPEFailed";
"22148" = "The 'SIZE' command is not available on this server";
"22149" = "The 'MDTM' command is not available on this server";
"22150" = "The server refused to rename the indicated file";
"22151" = "kErrGlobFailed";
"22152" = "kErrSetKeepAlive";
"22153" = "The server was disconnected during the login attempt";
"22154" = "The provided user ID was not known to the server";
"22155" = "The user name and/or password are incorrect or invalid. Please check for typos and try again";
"22156" = "The server refused the login attempt. Please check your user name and password for typos and try again";
"22157" = "An invalid or unexpected reply was received from the server";
"22158" = "The server closed the connection unexpectedly";
"22159" = "An operation was attempted while not connected to the server";
"22160" = "kErrCouldNotStartDataTransfer";
"22161" = "kErrDataTransferFailed";
"22162" = "The server refused to process the 'PORT' command. This may indicate a problem with the server or your network gateway";
"22163" = "The server refused to process the 'PASV' command. This may indicate a problem with the server or your network gateway";
"22164" = "kErrUTIMEFailed";
"22165" = "kErrUTIMENotAvailable";
"22166" = "kErrHELPFailed";
"22167" = "kErrLocalDeleteFailed";
"22168" = "kErrLseekFailed";
"22169" = "kErrDataTransferAborted";
"22170" = "kErrSYMLINKFailed";
"22171" = "kErrSYMLINKNotAvailable";
"22172" = "kErrGlobNoMatch";
"22173" = "kErrFEATNotAvailable";
"22174" = "kErrNoValidFilesSpecified";
"22175" = "kErrNoBuf";
"22176" = "kErrLocalFileNewer";
"22177" = "kErrRemoteFileNewer";
"22178" = "kErrLocalSameAsRemote";
"22179" = "kErrMLSDFailed";
"22180" = "kErrMLSTFailed";
"22181" = "kErrInvalidMLSTResponse";
"22182" = "kErrMLSTNotAvailable";
"22183" = "kErrMLSDNotAvailable";
"22184" = "kErrSTATFailed";
"22185" = "kErrSTATwithFileNotAvailable";
"22186" = "kErrNLSTFailed";
"22187" = "kErrNLSTwithFileNotAvailable";
"22188" = "kErrNoSuchFileOrDirectory";
"22189" = "kErrCantTellIfFileExists";
"22190" = "kErrFileExistsButCannotDetermineType";
"22191" = "kErrNotADirectory";
"22192" = "kErrRecursionLimitReached";
"22193" = "The control connection to the server has timed out; the network connection may be lost, or a network gateway may be interfering";
"22194" = "The data connection to the server has timed out; the network connection may be lost, or a network gateway may be interfering";
"22195" = "kErrUserCanceled";
"22196" = "kErrNoHostSpecified";
"22197" = "kErrRemoteSameAsLocal";
"22198" = "kErrProxyDataConnectionsDisabled";
"22199" = "kErrDataConnOriginatedFromBadPort";
"22200" = "kErrBugInLibrary";
"22201" = "kErrRESTNotAvailable";
"22202" = "kErrOpenHostMiscErr";
"22203" = "kErrLoginHostMiscErr";
"22204" = "kErrAsciiSeekErr";
"22205" = "kErrKnownBug";
"22206" = "kErrBindCtrlSocket";
"22801" = "An end-of-file condition was unexpectedly encountered while reading a file from the server";
"22802" = "A file or folder was not found on the server";
"22803" = "You have insufficient permissions to perform this operation on the server";
"22804" = "This operation could not be completed, but the server didn’t return a specific reason";
"22805" = "Unexpected response received from the server";
"22806" = "An operation was attempted on the server without an existing connection";
"22807" = "This server operation couldn’t be completed because the connection was unexpectedly lost";
"22808" = "An unsupported operation was attempted on the SFTP server";
"22809" = "Internal SFTP error (invalid file handle)";
"22812" = "The file system you’re trying to write to is write-protected";
"22813" = "Internal SFTP error (no media)";
"22814" = "The SFTP server returned a read request response length in excess of statutory limits";
"22815" = "SFTP services are not available (you’re running on Mac OS 9 or else the “sftp” command line tool is not installed)";
"22816" = "The TextWrangler application package has been modified, and a component required for SFTP operation has been moved or deleted";
"22817" = "This operation requires a file size, but the server didn’t supply one";
"22818" = "When renaming a file, the new name cannot begin with “/” (slash) or “~” (tilde)";
"22819" = "The host key has changed for the remote host. Please correct the host key in ~/.ssh/known_hosts to resolve this problem.";
"25001" = "Unexpected EOF; Document ended in the middle of a tag";
"25002" = "Unexpected EOF; Document ended in the middle of an SGML Instruction";
"25003" = "Unexpected EOF; Document ended in the middle of an SGML Declaration";
"25004" = "Unexpected EOF; document ended in the middle of an SGML Comment";
"25005" = "CDATA section terminated unexpectedly. (Hint: In <script> “</” should be escaped as “<\/”)";
"31000" = "The CSS parser encountered a block parsing error. Make sure the following characters are balanced properly: \",', (), [] and {}";
"32000" = "This file cannot be included in the current document because some characters in its path cannot be represented in the document’s encoding.";
"32001" = "Tidy encountered too many errors. Try running the “Check Document Syntax” command from the Markup menu.";
